trunk/Ruby/leilao/app/views/bids/_form.html.erb

    <%= f.label :'Selecine o leilão' %><br />
    <%= select :bid, :auction_id, Auction.all.collect{|a| [Concessionaire.find(Car.find(a.car_id).concessionaire_id).name+' - '+Assembler.find(Model.find(Car.find(a.car_id).model_id).assembler_id).name+' - '+Model.find(Car.find(a.car_id).model_id).name+' - '+Car.find(a.car_id).plate+' - '+Car.find(a.car_id).manufacture_year.to_s+'/'+Car.find(a.car_id).model_year.to_s+' - '+Car.find(a.car_id).colour+' - '+a.auction_start.to_s+' - R$'+a.initial_value.to_s, a.id]} %>
---
SELECT `assemblers`.* FROM `assemblers` WHERE `assemblers`.`id` = 1 ORDER BY name ASC LIMIT 1
SELECT `auctions`.* FROM `auctions` WHERE `auctions`.`id` = 1 LIMIT 1
SELECT `cars`.* FROM `cars` WHERE `cars`.`id` = 1 LIMIT 1
SELECT `concessionaires`.* FROM `concessionaires` WHERE `concessionaires`.`id` = 2 LIMIT 1

    <%= f.label :Cliente %><br />
    <%= select :bid, :client_id, Client.all.collect{|c| [c.name+' - '+c.cpf, c.id]} %>
---
SELECT `clients`.* FROM `clients`