trunk/Ruby/leilao/app/views/auctions/_form.html.erb

    <%= f.label :'Selecine o carro' %><br />
    <%= select :auction, :car_id, Car.all.collect{|c| [Concessionaire.find(Car.find(c.id).concessionaire_id).name+' - '+Assembler.find(Model.find(c.model_id).assembler_id).name+' - '+Model.find(c.model_id).name+' - '+c.plate+' - '+c.manufacture_year.to_s+'/'+c.model_year.to_s+' - '+c.colour, c.id]} %>
---
SELECT `assemblers`.* FROM `assemblers` WHERE `assemblers`.`id` = 1 ORDER BY name ASC LIMIT 1
SELECT `auctions`.* FROM `auctions` WHERE `auctions`.`id` = 1 LIMIT 1
SELECT `cars`.* FROM `cars` WHERE `cars`.`id` = 1 LIMIT 1
SELECT `concessionaires`.* FROM `concessionaires` WHERE `concessionaires`.`id` = 2 LIMIT 1