Ruby/leilao/app/views/models/_form.html.erb

SELECT `models`.`id` FROM `models` WHERE (`models`.`name` = BINARY 'Celta') LIMIT 1
---
    <%= f.label :"Selecione uma montadora" %>
    <%= select :model, :assembler_id, Assembler.find(:all).collect{|a| [a.name, a.id]} %>