Ruby/leilao/app/views/models/index.html.erb

SELECT `assemblers`.* FROM `assemblers` WHERE `assemblers`.`id` = 1 ORDER BY name ASC LIMIT 1
---
  <tr>
    <td><%= Assembler.find(model.ass_code).name %></td>