trunk/Ruby/leilao/app/views/devise/registrations/new.html.erb

SELECT `roles`.* FROM `roles`
---
	<p><%= f.label :admin_level %>
	<% Role.all.each do |role| %>