trunk/Node/teste/app/controllers/auctions_controller.rb

  def index
    @auctions = Auction.all
---
SELECT `auctions`.* FROM `auctions`

  def show
    @auction = Auction.find(params[:id])
---
SELECT `auctions`.* FROM `auctions` WHERE `auctions`.`id` = 1 LIMIT 1

  def edit
    @auction = Auction.find(params[:id])
---
SELECT `auctions`.* FROM `auctions` WHERE `auctions`.`id` = 1 LIMIT 1

  def create
    @auction = Auction.new(params[:auction])

    respond_to do |format|
      if @auction.save
---
INSERT INTO `auctions` (`value`, `created_at`, `updated_at`, `finish_at`, `name`) VALUES (0.1, '2011-06-29 14:00:26', '2011-06-29 14:00:26', '2011-06-30 14:00:00', 'Celular')

  def update
    @auction = Auction.find(params[:id])

    respond_to do |format|
      if @auction.update_attributes(params[:auction])
---
SELECT `auctions`.* FROM `auctions` WHERE `auctions`.`id` = 1 LIMIT 1
UPDATE `auctions` SET `value` = 0, `updated_at` = '2011-06-23 22:43:25' WHERE `auctions`.`id` = 1