trunk/Ruby/leilao/app/controllers/cars_controller.rb

SELECT `cars`.* FROM `cars` ORDER BY name ASC
---
  def index
    @cars = Car.all

SELECT `cars`.* FROM `cars` WHERE `cars`.`id` = 1 LIMIT 1
---
  def show
    @car = Car.find(params[:id])

SELECT `cars`.* FROM `cars` WHERE `cars`.`id` = 1 LIMIT 1
---
  def edit
    @car = Car.find(params[:id])

INSERT INTO `cars` (`model_id`, `engine`, `plate`, `colour`, `mileage`, `manufacture_year`, `model_year`, `comments`, `created_at`, `updated_at`, `concessionaire_id`) VALUES (1, '1.0', 'nww-2713', 'Prata', 2000, 2011, 2012, '', '2011-04-14 13:46:01', '2011-04-14 13:46:01', 2)
---
  def create
    @car = Car.new(params[:car])

    respond_to do |format|
      if @car.save

SELECT `cars`.* FROM `cars` WHERE `cars`.`id` = 1 LIMIT 1
UPDATE `cars` SET `concessionaire_id` = 1, `updated_at` = '2011-04-14 12:31:11' WHERE `cars`.`id` = 1
---
  def update
    @car = Car.find(params[:id])

    respond_to do |format|
      if @car.update_attributes(params[:car])