trunk/Ruby/leilao/app/controllers/clients_controller.rb

  def show
    @client = Client.find(params[:id])
---
SELECT `clients`.* FROM `clients` WHERE `clients`.`id` = 1 LIMIT 1

  def edit
    @client = Client.find(params[:id])
---
SELECT `clients`.* FROM `clients` WHERE `clients`.`id` = 1 LIMIT 1

  def create
    @client = Client.new(params[:client])

    respond_to do |format|
      if @client.save
---
INSERT INTO `clients` (`cpf`, `city_id`, `name`, `created_at`, `updated_at`) VALUES ('123.123.123-65', 1, 'AJ', '2011-04-14 13:06:55', '2011-04-14 13:06:55')

  def update
    @client = Client.find(params[:id])

    respond_to do |format|
      if @client.update_attributes(params[:client])
---
SELECT `clients`.* FROM `clients` WHERE `clients`.`id` = 1 LIMIT 1
UPDATE `clients` SET `name` = 'AJ Alves', `updated_at` = '2011-04-14 13:07:45' WHERE `clients`.`id` = 1