trunk/Ruby/leilao/app/controllers/concessionaires_controller.rb

  def index
    @concessionaires = Concessionaire.all
---
SELECT `concessionaires`.* FROM `concessionaires`

  def show
    @concessionaire = Concessionaire.find(params[:id])
---
SELECT `concessionaires`.* FROM `concessionaires` WHERE `concessionaires`.`id` = 1 LIMIT 1

  def edit
    @concessionaire = Concessionaire.find(params[:id])
---
SELECT `concessionaires`.* FROM `concessionaires` WHERE `concessionaires`.`id` = 2 LIMIT 1

  def create
    @concessionaire = Concessionaire.new(params[:concessionaire])

    respond_to do |format|
      if @concessionaire.save
---
INSERT INTO `concessionaires` (`name`, `created_at`, `updated_at`) VALUES ('Alemanha', '2011-04-14 12:14:55', '2011-04-14 12:14:55')

  def update
    @concessionaire = Concessionaire.find(params[:id])

    respond_to do |format|
      if @concessionaire.update_attributes(params[:concessionaire])
---
SELECT `concessionaires`.* FROM `concessionaires` WHERE `concessionaires`.`id` = 2 LIMIT 1
UPDATE `concessionaires` SET `name` = 'Canadá', `updated_at` = '2011-04-15 14:00:12' WHERE `concessionaires`.`id` = 2