Ruby/leilao/app/views/auctions/_form.html.erb

    <%= f.label :'Selecine o carro' %><br />
    <%= select :auction, :car_id, Car.all.collect{|c| [c.concessionaire.name+' - '+c.model.assembler.name+' - '+c.model.name+' - '+c.plate+' - '+c.manufacture_year.to_s+'/'+c.model_year.to_s+' - '+c.colour, c.id]} %>
---
SELECT `assemblers`.* FROM `assemblers` WHERE `assemblers`.`id` = 1 LIMIT 1
SELECT `cars`.* FROM `cars`
SELECT `concessionaires`.* FROM `concessionaires` WHERE `concessionaires`.`id` = 2 LIMIT 1
SELECT `models`.* FROM `models` WHERE `models`.`id` = 1 LIMIT 1