Ruby/leilao/app/views/auctions/index.html.erb

  <tr>
	<% c = Car.find(auction.car_id) %>
    <td><%= Concessionaire.find(Car.find(c.id).concessionaire_id).name+' - '+Assembler.find(Model.find(c.model_id).assembler_id).name+' - '+Model.find(c.model_id).name+' - '+c.plate+' - '+c.manufacture_year.to_s+'/'+c.model_year.to_s+' - '+c.colour %></td>
---
SELECT `cars`.* FROM `cars` WHERE `cars`.`id` = 1 LIMIT 1
SELECT `assemblers`.* FROM `assemblers` WHERE `assemblers`.`id` = 1 LIMIT 1
SELECT `concessionaires`.* FROM `concessionaires` WHERE `concessionaires`.`id` = 2 LIMIT 1
SELECT `models`.* FROM `models` WHERE `models`.`id` = 1 LIMIT 1