Ruby/leilao/app/controllers/assemblers_controller.rb

SELECT `assemblers`.* FROM `assemblers` ORDER BY name ASC
---
  def index
    @assemblers = Assembler.all

SELECT `assemblers`.* FROM `assemblers` WHERE `assemblers`.`id` = 3 ORDER BY name ASC LIMIT 1
---
  def show
    @assembler = Assembler.find(params[:id])

SELECT `assemblers`.* FROM `assemblers` WHERE `assemblers`.`id` = 2 LIMIT 1
---
  def edit
    @assembler = Assembler.find(params[:id])

INSERT INTO `assemblers` (`name`, `created_at`, `updated_at`) VALUES ('Chevrolet', '2011-04-12 13:49:03', '2011-04-12 13:49:03')
---
  def create
    @assembler = Assembler.new(params[:assembler])

    respond_to do |format|
      if @assembler.save

SELECT `assemblers`.* FROM `assemblers` WHERE `assemblers`.`id` = 2 LIMIT 1
UPDATE `assemblers` SET `name` = 'Wolksvagem', `updated_at` = '2011-04-12 14:12:54' WHERE `assemblers`.`id` = 2
---
  def update
    @assembler = Assembler.find(params[:id])

    respond_to do |format|
      if @assembler.update_attributes(params[:assembler])