Ruby/leilao/app/controllers/auctions_controller.rb

  def index
    @auctions = Auction.all
---
SELECT `auctions`.* FROM `auctions`

  def show
    @auction = Auction.find(params[:id])
---
SELECT `auctions`.* FROM `auctions` WHERE `auctions`.`id` = 1 LIMIT 1

  def edit
    @auction = Auction.find(params[:id])
---
SELECT `auctions`.* FROM `auctions` WHERE `auctions`.`id` = 1 LIMIT 1

  def create
    @auction = Auction.new(params[:auction])

    respond_to do |format|
      if @auction.save
---
INSERT INTO `auctions` (`car_id`, `auction_start`, `initial_value`, `buy_now_value`, `capping_value`, `status`, `created_at`, `updated_at`) VALUES (1, '2011-04-14 14:18:00', 2, 21000, NULL, 1, '2011-04-14 14:22:28', '2011-04-14 14:22:28')

  def update
    @auction = Auction.find(params[:id])

    respond_to do |format|
      if @auction.update_attributes(params[:auction])
---
SELECT `auctions`.* FROM `auctions` WHERE `auctions`.`id` = 1 LIMIT 1
UPDATE `auctions` SET `initial_value` = 22000, `updated_at` = '2011-04-14 14:24:41' WHERE `auctions`.`id` = 1