Ruby/leilao/app/controllers/bids_controller.rb

SELECT `bids`.* FROM `bids`
---
  def index
    @bids = Bid.all

SELECT `bids`.* FROM `bids` WHERE `bids`.`id` = 1 LIMIT 1
---
  def show
    @bid = Bid.find(params[:id])

INSERT INTO `bids` (`auction_id`, `client_id`, `value`, `created_at`, `updated_at`) VALUES (1, 1, 500, '2011-04-15 12:53:16', '2011-04-15 12:53:16')
---
  def create
    @bid = Bid.new(params[:bid])

    respond_to do |format|
      if @bid.save