Ruby/leilao/app/controllers/cities_controller.rb

SELECT `cities`.* FROM `cities`
---
  def index
    @cities = City.all

SELECT `cities`.* FROM `cities` WHERE `cities`.`id` = 1 LIMIT 1
---
  def show
    @city = City.find(params[:id])

SELECT `cities`.* FROM `cities` WHERE `cities`.`id` = 1 LIMIT 1
---
  def edit
    @city = City.find(params[:id])

INSERT INTO `cities` (`state_id`, `name`, `created_at`, `updated_at`) VALUES (1, 'Teresinaaaa', '2011-04-14 12:50:25', '2011-04-14 12:50:25')
---
  def create
    @city = City.new(params[:city])

    respond_to do |format|
      if @city.save

SELECT `cities`.* FROM `cities` WHERE `cities`.`id` = 1 LIMIT 1
UPDATE `cities` SET `name` = 'Teresina', `updated_at` = '2011-04-14 12:54:01' WHERE `cities`.`id` = 1
---
  def update
    @city = City.find(params[:id])

    respond_to do |format|
      if @city.update_attributes(params[:city])

SELECT `cities`.* FROM `cities` WHERE `cities`.`id` = 2 LIMIT 1
DELETE FROM `cities` WHERE `cities`.`id` = 2
---
  def destroy
    @city = City.find(params[:id])
    @city.destroy