Ruby/leilao/app/controllers/fuels_controller.rb

  def index
    @fuels = Fuel.all
---
SELECT `fuels`.* FROM `fuels`

  def show
    @fuel = Fuel.find(params[:id])
---
SELECT `fuels`.* FROM `fuels` WHERE `fuels`.`id` = 1 LIMIT 1

  def create
    @fuel = Fuel.new(params[:fuel])

    respond_to do |format|
      if @fuel.save
---
INSERT INTO `fuels` (`name`, `created_at`, `updated_at`) VALUES ('Gasolina', '2011-04-13 13:24:12', '2011-04-13 13:24:12')

  def destroy
    @fuel = Fuel.find(params[:id])
    @fuel.destroy
---
SELECT `fuels`.* FROM `fuels` WHERE `fuels`.`id` = 5 LIMIT 1
DELETE FROM `fuels` WHERE `fuels`.`id` = 5