Ruby/leilao/app/controllers/models_controller.rb

  def index
    @models = Model.all
---
SELECT `models`.* FROM `models` ORDER BY name ASC

  def show
    @model = Model.find(params[:id])
---
SELECT `models`.* FROM `models` WHERE `models`.`id` = 4 ORDER BY name ASC LIMIT 1

  def edit
    @model = Model.find(params[:id])
---
SELECT `models`.* FROM `models` WHERE `models`.`id` = 1 LIMIT 1

  def create
    @model = Model.new(params[:model])

    respond_to do |format|
      if @model.save
---
INSERT INTO `models` (`name`, `created_at`, `updated_at`, `assembler_id`) VALUES ('Celta', '2011-04-13 14:48:09', '2011-04-13 14:48:09', 1)

  def update
    @model = Model.find(params[:id])

    respond_to do |format|
      if @model.update_attributes(params[:model])
---
SELECT `models`.* FROM `models` WHERE `models`.`id` = 2 LIMIT 1
UPDATE `models` SET `ass_code` = 2, `updated_at` = '2011-04-12 14:14:13' WHERE `models`.`id` = 2