Ruby/leilao/app/controllers/optionals_controller.rb

  def index
    @optionals = Optional.all
---
SELECT `optionals`.* FROM `optionals`

  def show
    @optional = Optional.find(params[:id])
---
SELECT `optionals`.* FROM `optionals` WHERE `optionals`.`id` = 1 LIMIT 1

  def edit
    @optional = Optional.find(params[:id])
---
SELECT `optionals`.* FROM `optionals` WHERE `optionals`.`id` = 3 LIMIT 1

  def create
    @optional = Optional.new(params[:optional])

    respond_to do |format|
      if @optional.save
---
INSERT INTO `optionals` (`name`, `created_at`, `updated_at`) VALUES ('Vidro eletrico', '2011-04-13 21:59:29', '2011-04-13 21:59:29')

  def update
    @optional = Optional.find(params[:id])

    respond_to do |format|
      if @optional.update_attributes(params[:optional])
---
SELECT `optionals`.* FROM `optionals` WHERE `optionals`.`id` = 3 LIMIT 1
UPDATE `optionals` SET `name` = 'Protetor', `updated_at` = '2011-04-15 13:59:42' WHERE `optionals`.`id` = 3