Ruby/leilao/app/controllers/states_controller.rb

SELECT `states`.* FROM `states`
---
  def index
    @states = State.all

SELECT `states`.* FROM `states` WHERE `states`.`id` = 1 LIMIT 1
---
  def show
    @state = State.find(params[:id])

SELECT `states`.* FROM `states` WHERE `states`.`id` = 1 LIMIT 1
---
  def edit
    @state = State.find(params[:id])

INSERT INTO `states` (`name`, `acronym`, `created_at`, `updated_at`) VALUES ('Maranhão', 'MA', '2011-04-11 14:47:30', '2011-04-11 14:47:30')
---
  def create
    @state = State.new(params[:state])

    respond_to do |format|
      if @state.save

SELECT `states`.* FROM `states` WHERE `states`.`id` = 1 LIMIT 1
UPDATE `states` SET `name` = 'Piaui', `acronym` = 'PI', `updated_at` = '2011-04-16 13:19:35' WHERE `states`.`id` = 1
---
  def update
    @state = State.find(params[:id])

    respond_to do |format|
      if @state.update_attributes(params[:state])