trunk/Ruby/leilao/app/views/models/_form.html.erb

    <%= f.label :"Selecione uma montadora" %>
    <%= select :model, :ass_code, Assembler.find(:all).collect{|a| [a.name, a.id]} %>
---
SELECT `models`.`id` FROM `models` WHERE (`models`.`name` = BINARY 'Celta') LIMIT 1