trunk/Ruby/leilao/app/views/models/index.html.erb

  <tr>
    <td><%= Assembler.find(model.assembler_id).name %></td>
---
SELECT `assemblers`.* FROM `assemblers` WHERE `assemblers`.`id` = 1 ORDER BY name ASC LIMIT 1