trunk/Ruby/leilao/app/views/models/show.html.erb

  <b>Montadora:</b>
  <%= Assembler.find(@model.assembler_id).name %>
---
SELECT `assemblers`.* FROM `assemblers` WHERE `assemblers`.`id` = 3 ORDER BY name ASC LIMIT 1