trunk/Ruby/leilao/app/views/cars/_form.html.erb

SELECT `concessionaires`.* FROM `concessionaires`
---
    <%= f.label :"Selecione a concessionária" %><br />
    <%= select :car, :concessionaire_id, Concessionaire.all.collect{|c| [c.name, c.id]} %>

SELECT `assemblers`.* FROM `assemblers` WHERE `assemblers`.`id` = 1 ORDER BY name ASC LIMIT 1
SELECT `models`.* FROM `models` ORDER BY name ASC
---
    <%= f.label :"Selecione um modelo" %><br />
    <%= select :car, :model_id, Model.all.collect{|m| [m.assembler.name+' - '+m.name, m.id]} %>

SELECT `fuels`.* FROM `fuels`
---
    <%= f.label :"Selecione os combustíveis" %><br />
	<% Fuel.all.each do |fuel| %>

SELECT `optionals`.* FROM `optionals`
---
    <%= f.label :"Selecione os opcionais" %><br />
	<% Optional.all.each do |optional| %>