trunk/Ruby/leilao/app/views/cars/index.html.erb

SELECT `concessionaires`.* FROM `concessionaires` WHERE `concessionaires`.`id` = 2 LIMIT 1
SELECT `models`.* FROM `models` WHERE `models`.`id` = 1 ORDER BY name ASC LIMIT 1
---
  <tr>
    <td><%= Concessionaire.find(car.concessionaire_id).name %></td>
    <td><%= Model.find(car.model_id).name %></td>

SELECT `fuels`.* FROM `fuels` INNER JOIN `cars_fuels` ON `fuels`.id = `cars_fuels`.fuel_id WHERE (`cars_fuels`.car_id = 1 )
---
    <td>
	<% if car.fuels.all.length > 1 %>

SELECT `optionals`.* FROM `optionals` INNER JOIN `cars_optionals` ON `optionals`.id = `cars_optionals`.optional_id WHERE (`cars_optionals`.car_id = 1 )
---
    <td><%= car.model_year %></td>
    <td><%= car.optionals.all.length %></td>