trunk/Ruby/leilao/app/views/cars/show.html.erb

SELECT `models`.* FROM `models` WHERE `models`.`id` = 1 ORDER BY name ASC LIMIT 1
---
  <b>Modelo do carro:</b>
  <%= Model.find(@car.model_id).name %>

SELECT `fuels`.* FROM `fuels` INNER JOIN `cars_fuels` ON `fuels`.id = `cars_fuels`.fuel_id WHERE (`cars_fuels`.car_id = 1 )
---
	<b>Combustíveis:</b>
	<% @car.fuels.all.each do |fuel| %>