Ruby/leilao/app/views/bids/_form.html.erb

    <%= f.label :'Selecine o leilão' %><br />
    <%= select :bid, :auction_id, Auction.all.collect{|a| [a.car.concessionaire.name+' - '+a.car.model.assembler.name+' - '+a.car.model.name+' - '+a.car.plate+' - '+a.car.manufacture_year.to_s+'/'+a.car.model_year.to_s+' - '+a.car.colour+' - '+a.auction_start.to_s+' - R$'+a.initial_value.to_s, a.id]} %>
---
SELECT `assemblers`.* FROM `assemblers` WHERE `assemblers`.`id` = 1 ORDER BY name ASC LIMIT 1
SELECT `auctions`.* FROM `auctions`
SELECT `cars`.* FROM `cars` WHERE `cars`.`id` = 1 LIMIT 1
SELECT `concessionaires`.* FROM `concessionaires` WHERE `concessionaires`.`id` = 2 LIMIT 1

    <%= f.label :Cliente %><br />
    <%= select :bid, :client_id, Client.all.collect{|c| [c.name+' - '+c.cpf, c.id]} %>
---
SELECT `clients`.* FROM `clients`