Ruby/leilao/app/views/bids/_form.html.erb

    <%= f.label :'Selecine o leilão' %><br />
    <%= select :bid, :auction_id, Car.all.collect{|c| [Assembler.find(Model.find(c.model_id).assembler_id).name+' - '+Model.find(c.model_id).name+' - '+c.plate+' - '+c.manufacture_year.to_s+'/'+c.model_year.to_s+' - '+c.colour, Auction.find(c.id).id]} %>
---
SELECT `auctions`.* FROM `auctions` WHERE `auctions`.`id` = 1 LIMIT 1