Ruby/leilao/app/views/bids/show.html.erb

  <b>Leilão:</b>
  <% a = Auction.find(@bid.auction_id) %>
  <% c = Client.find(@bid.client_id) %>
  <%= Concessionaire.find(Car.find(a.car_id).concessionaire_id).name+' - '+Assembler.find(Model.find(Car.find(a.car_id).model_id).assembler_id).name+' - '+Model.find(Car.find(a.car_id).model_id).name+' - '+Car.find(a.car_id).plate+' - '+Car.find(a.car_id).manufacture_year.to_s+'/'+Car.find(a.car_id).model_year.to_s+' - '+Car.find(a.car_id).colour+' - '+a.auction_start.to_s+' - R$'+a.initial_value.to_s %>
---
SELECT `auctions`.* FROM `auctions` WHERE `auctions`.`id` = 1 LIMIT 1
SELECT `clients`.* FROM `clients` WHERE `clients`.`id` = 1 LIMIT 1
SELECT `assemblers`.* FROM `assemblers` WHERE `assemblers`.`id` = 1 ORDER BY name ASC LIMIT 1
SELECT `cars`.* FROM `cars` WHERE `cars`.`id` = 1 LIMIT 1
SELECT `concessionaires`.* FROM `concessionaires` WHERE `concessionaires`.`id` = 2 LIMIT 1
SELECT `models`.* FROM `models` WHERE `models`.`id` = 1 ORDER BY name ASC LIMIT 1