trunk/Ruby/leilao/app/views/cities/_form.html.erb

SELECT `states`.* FROM `states`
---
    <%= f.label :Estado %><br />
    <%= select :city, :state_id, State.all.collect{|e| [e.name, e.id]} %>