trunk/Ruby/leilao/app/views/cities/index.html.erb

SELECT `states`.* FROM `states` WHERE `states`.`id` = 1 LIMIT 1
---
  <tr>
    <td><%= State.find(city.state_id).name %></td>