trunk/Ruby/leilao/app/views/cities/show.html.erb

  <b>Estado:</b>
  <%= State.find(@city.state_id).name %>
---
SELECT `states`.* FROM `states` WHERE `states`.`id` = 1 LIMIT 1