Ruby/leilao/app/views/clients/_form.html.erb

    <%= f.label :Cidade %><br />
    <%= select :client, :city_id, City.all.collect{|c| [c.name, c.id]} %>
---
SELECT `cities`.* FROM `cities`