Ruby/leilao/app/views/clients/show.html.erb

  <b>Cidade:</b>
  <%= City.find(@client.city_id).name %>
---
SELECT `cities`.* FROM `cities` WHERE `cities`.`id` = 1 LIMIT 1