trunk/Ruby/leilao/app/views/clients/_form.html.erb

    <%= f.label :Cidade %><br />
    <%= select :client, :city_id, City.all.collect{|c| [c.name+' - '+State.find(c.state_id).name, c.id]} %>
---
SELECT `clients`.* FROM `clients` WHERE `clients`.`id` = 1 LIMIT 1
SELECT `states`.* FROM `states` WHERE `states`.`id` = 1 LIMIT 1