trunk/Ruby/leilao/app/views/clients/index.html.erb

    <td><%= client.cpf %></td>
    <td><%= City.find(client.city_id).name %></td>
---
SELECT `cities`.* FROM `cities` WHERE `cities`.`id` = 1 LIMIT 1