Ruby/leilao/app/views/cars/show.html.erb

SELECT `concessionaires`.* FROM `concessionaires` WHERE `concessionaires`.`id` = 2 LIMIT 1
---
  <b>Concessionária:</b>
  <%= Concessionaire.find(@car.concessionaire_id).name %>

SELECT `models`.* FROM `models` WHERE `models`.`id` = 1 LIMIT 1
---
  <b>Modelo do carro:</b>
  <%= Model.find(@car.model_id).name %>

SELECT `fuels`.* FROM `fuels` INNER JOIN `cars_fuels` ON `fuels`.id = `cars_fuels`.fuel_id WHERE (`cars_fuels`.car_id = 1 )
---
	<b>Combustíveis:</b>
	<%= @car.fuels.collect{|f| [f.name]}.join(", ") %>

SELECT `optionals`.* FROM `optionals` INNER JOIN `cars_optionals` ON `optionals`.id = `cars_optionals`.optional_id WHERE (`cars_optionals`.car_id = 1 )
---
	<b>Opcionais:</b>
	<%= @car.optionals.collect{|o| [o.name]}.join(", ") %>